app/controllers/holidays_controller.rb

SELECT * FROM "holidays"
SELECT * FROM "holidays" WHERE ("holidays"."user_id" = 7)
---
  def index
    if current_user.admin == true
      @holidays = Holiday.all
    else
      @holidays = Holiday.find_all_by_user_id(current_user.id)

SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)
---
  def show
    @holiday = Holiday.find(params[:id])

INSERT INTO "holidays" ("number_of_days", "created_at", "date_to", "updated_at", "date_from", "approved", "user_id") VALUES(2.0, '2012-01-23 18:41:34', '2012-01-23', '2012-01-23 18:41:34', '2012-01-23', NULL, 7)
---
  def create
    @holiday = Holiday.new(params[:holiday])
    @holiday.user_id = current_user.id
    if @holiday.save

SELECT * FROM "holidays" WHERE ("holidays"."id" = 3)
---
  def edit
    @holiday = Holiday.find(params[:id])

SELECT * FROM "holidays" WHERE ("holidays"."id" = 42)
UPDATE "holidays" SET "updated_at" = '2012-01-23 16:50:52', "date_to" = '2012-01-26', "number_of_days" = 3.0 WHERE "id" = 42
---
  def update
    @holiday = Holiday.find(params[:id])
    if @holiday.update_attributes(params[:holiday])

SELECT * FROM "holidays" WHERE ("holidays"."id" = 3)
DELETE FROM "holidays" WHERE "id" = 3
---
  def destroy
    @holiday = Holiday.find(params[:id])
    @holiday.destroy